In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\KIIT\\Desktop\\2d.csv")

In [3]:
df

    ID     Name Department  Salary Active
0  1.0    Vidhi         IT   25000    Yes
1  2.0   Rajesh      Sales   22000    Yes
2  3.0  Shivani      Sales   24000     No
3  4.0    Javed       Ecom   21000    Yes
4  5.0     Aman   Analysis   20000    Yes
5  6.0    Alice         HR   22000     No
6  7.0   Raghav   Security   17000    Yes
7  NaN    Tejas        NaN   25000    NaN

In [4]:
df.loc[0]  #labels of a row..0 ke jagah 5 place kiya to it'll show data of alice

ID              1.0
Name          Vidhi
Department       IT
Salary        25000
Active          Yes
Name: 0, dtype: object

In [5]:
df.loc[[1,2,3]] #list of labels to print multiple rows

    ID     Name Department  Salary Active
1  2.0   Rajesh      Sales   22000    Yes
2  3.0  Shivani      Sales   24000     No
3  4.0    Javed       Ecom   21000    Yes

In [6]:
df.loc[5,"Salary"] #5th column me salary kya hai?

22000

In [8]:
df.loc[0:2,"Name"]  #name using slicing

0      Vidhi
1     Rajesh
2    Shivani
Name: Name, dtype: object

In [11]:
df.loc[df['Salary']<20000] #conditional statement where salary < 20000

    ID    Name Department  Salary Active
6  7.0  Raghav   Security   17000    Yes

In [12]:
df.loc[df['Salary']<20000,["Salary"]] #if only koi ek hi column chahiye ho to

   Salary
6   17000

In [13]:
df.iloc[0]  #integer based loc

ID              1.0
Name          Vidhi
Department       IT
Salary        25000
Active          Yes
Name: 0, dtype: object

In [14]:
df.iloc[:,0]  #all rows, 0 column

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
Name: ID, dtype: float64

In [16]:
df.iloc[[0,1]] #data of 0,1 rows

    ID    Name Department  Salary Active
0  1.0   Vidhi         IT   25000    Yes
1  2.0  Rajesh      Sales   22000    Yes